tests/load/load-test.yml
config:
  target: "http://localhost:5500"  # サーバーのベースURL
  phases:
    - name: "ウォームアップ"
      duration: 30
      arrivalRate: 2
    - name: "負荷上昇"
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: "高負荷維持"
      duration: 120
      arrivalRate: 20
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    expect: {}  # レスポンス検証用
    cookies: {}  # Cookie管理用

scenarios:
  - name: "認証フロー"
    flow:
      # サインアップ
      - post:
          url: "/api/v1/auth/signup"
          json:
            name: "テストユーザー {{ $randomNumber(1,1000) }}"
            username: "testuser{{ $randomNumber(1000,9999) }}"
            email: "test{{ $randomNumber(1000,9999) }}@example.com"
            password: "password123"
          expect:
            statusCode: 201
          capture:
            - json: "$.message"
              as: "signupMessage"
      
      # 一時停止（レート制限対策）
      - think: 2
      
      # ログイン
      - post:
          url: "/api/v1/auth/login"
          json:
            username: "testuser{{ $randomNumber(1000,9999) }}"
            password: "password123"
          expect:
            statusCode: 200
            json:
              message: "ログインに成功しました。"
      
      # 一時停止（処理時間シミュレート）
      - think: 1
      
      # 現在のユーザー情報取得
      - get:
          url: "/api/v1/auth/me"
          expect:
            statusCode: 200
      
      # ログアウト
      - post:
          url: "/api/v1/auth/logout"
          expect:
            statusCode: 200
            json:
              message: "ログアウトしました。"

  # エラーケースのテスト
  - name: "認証エラーケース"
    weight: 3  # メインシナリオの1/3の頻度で実行
    flow:
      # 無効なログイン
      - post:
          url: "/api/v1/auth/login"
          json:
            username: "nonexistent"
            password: "wrongpass"
          expect:
            statusCode: 401
      
      # 無効なサインアップ（パスワード不足）
      - post:
          url: "/api/v1/auth/signup"
          json:
            name: "Invalid User"
            username: "invalid"
            email: "invalid@test.com"
            password: "12345"  # 6文字未満
          expect:
            statusCode: 400