tests/load/post-test.yml
config:
  target: "http://localhost:5500"
  phases:
    - name: "ウォームアップ"
      duration: 30
      arrivalRate: 2
    - name: "負荷上昇"
      duration: 60
      arrivalRate: 5
      rampTo: 15
    - name: "高負荷テスト"
      duration: 120
      arrivalRate: 15
  plugins:
    expect: {}
    cookies: {}

scenarios:
  - name: "投稿フロー"
    weight: 4
    flow:
      # ログイン
      - post:
          url: "/api/v1/auth/login"
          json:
            username: "testuser1"
            password: "password123"
          capture:
            - header: "set-cookie"
              as: "authCookie"
          expect:
            statusCode: 200

      # フィード取得
      - get:
          url: "/api/v1/posts"
          headers:
            Cookie: "{{ authCookie }}"
          expect:
            statusCode: 200

      # 新規投稿作成
      - post:
          url: "/api/v1/posts/create"
          headers:
            Cookie: "{{ authCookie }}"
          json:
            content: "テスト投稿 #{{ $randomNumber(1000,9999) }}"
          capture:
            - json: "$._id"
              as: "postId"
          expect:
            statusCode: 201

      # 投稿詳細取得
      - get:
          url: "/api/v1/posts/{{ postId }}"
          headers:
            Cookie: "{{ authCookie }}"
          expect:
            statusCode: 200

      # コメント投稿
      - post:
          url: "/api/v1/posts/{{ postId }}/comment"
          headers:
            Cookie: "{{ authCookie }}"
          json:
            content: "テストコメント #{{ $randomNumber(1,1000) }}"
          expect:
            statusCode: 200

      # いいね
      - post:
          url: "/api/v1/posts/{{ postId }}/like"
          headers:
            Cookie: "{{ authCookie }}"
          expect:
            statusCode: 200

  - name: "閲覧シナリオ"
    weight: 6
    flow:
      # ログイン
      - post:
          url: "/api/v1/auth/login"
          json:
            username: "testuser2"
            password: "password123"
          capture:
            - header: "set-cookie"
              as: "authCookie"
          expect:
            statusCode: 200

      # フィードの定期的な取得
      - loop:
          - get:
              url: "/api/v1/posts"
              headers:
                Cookie: "{{ authCookie }}"
              expect:
                statusCode: 200
          - think: 2
        count: 3

  - name: "エラーケース"
    weight: 2
    flow:
      # 認証なしでの投稿
      - post:
          url: "/api/v1/posts/create"
          json:
            content: "認証なしの投稿"
          expect:
            statusCode: 401

      # 空の投稿
      - post:
          url: "/api/v1/posts/create"
          headers:
            Cookie: "{{ authCookie }}"
          json:
            content: ""
          expect:
            statusCode: 400

      # 存在しない投稿へのアクセス
      - get:
          url: "/api/v1/posts/invalid_id"
          headers:
            Cookie: "{{ authCookie }}"
          expect:
            statusCode: 404